app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 19]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 19], ["LIMIT", 1]]
---
          <%= link_to  image_tag(@article.user.image,class:"rounded-circle", style:"height:170px; width:20%;"), method: :get %>
          <% if @article.categories.any? %>