app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 4]]
---
            </h5>
            <p class="card-text"><%= pluralize(user.articles.count , "article") %></p>