app/controllers/users_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]
---
  def show
    @articles = @user.articles.paginate(page: params[:page] , per_page: 5)

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "awonfalcon123"], ["updated_at", "2021-02-21 05:27:28.545657"], ["id", 2]]
---
  def update
    if @user.update(user_params)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save